guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
        // Initialize frontend (which also initializes backend).
    err_code = nrf_crypto_hmac_init(&m_context,
                                    &g_nrf_crypto_hmac_sha256_info,
                                    accountkey_array[i].account_key,
                                    FP_ACCOUNT_KEY_LEN);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_init err %x\n",err_code);
      }
    

    // Push all data in one go (could be done repeatedly)
    err_code = nrf_crypto_hmac_update(&m_context, auth_data_buf, auth_data_buf_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_update err %x\n",err_code);
      }

    // Finish calculation
    err_code = nrf_crypto_hmac_finalize(&m_context, local_auth_seg, &local_auth_seg_len);
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_finalize err %x\n",err_code);
      }
    //print_hex(" Pauth_seg ", Pauth_seg, 8);
    //print_hex(" local_auth_seg ", local_auth_seg, 8);
   if(!memcmp(local_auth_seg, Pauth_seg, FP_FMDN_AUTH_SEG_LEN))
   {print_hex("account_key: ", accountkey_array[i].account_key, FP_ACCOUNT_KEY_LEN);
      memcpy(owner_account_key,accountkey_array[i].account_key,FP_ACCOUNT_KEY_LEN);
      return true;
   }
  }
  return false;
}
static int beacon_parameters_read_handle(uint8_t *data,uint16_t len,uint8_t *rsp_buf)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    size_t auth_data_buf_len = 0;
    bool result =false;
    ret_code_t            err_code;
    static const uint8_t req_data_len = BEACON_PARAMETERS_REQ_PAYLOAD_LEN;
  static const uint8_t rsp_data_len = BEACON_PARAMETERS_RSP_PAYLOAD_LEN;
    struct fp_fmdn_auth_data auth_data;
    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);

    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = random_nonce;
    auth_data.data_id = BEACON_ACTIONS_BEACON_PARAMETERS_READ;
    auth_data.data_len = req_data_len;

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);

    result = account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);

    NRF_LOG_INFO("beacon_parameters_read_handle result %x\n",result);

    uint8_t rsp_data_buf[BEACON_PARAMETERS_RSP_ADD_DATA_LEN];
    memset(rsp_data_buf,0,BEACON_PARAMETERS_RSP_ADD_DATA_LEN);
    int32_t calibrated_tx_power;
    int8_t tx_power;
    calibrated_tx_power = 0;
    calibrated_tx_power += FMDN_TX_POWER_CORRECTION_VAL;
    tx_power = calibrated_tx_power;
    rsp_data_buf[0] = tx_power;

    uint8_t clock_bigendian[FMDN_EID_SEED_FMDN_CLOCK_LEN];
    uint32_t fmdn_clock_copy;
    fmdn_clock_copy = fmdn_clock;
    sys_put_be32(fmdn_clock_copy,clock_bigendian);
    memcpy(rsp_data_buf+1,clock_bigendian,FMDN_EID_SEED_FMDN_CLOCK_LEN);
    rsp_data_buf[5] = 0x01;


    nrf_crypto_aes_info_t const * p_ecb_info;
    nrf_crypto_aes_context_t      ecb_encr_ctx;
    uint8_t rsp_data_enc[FP_CRYPTO_AES128_BLOCK_LEN];
    size_t len_out;
    p_ecb_info = &g_nrf_crypto_aes_ecb_128_info;
    len_out = 16;
    /* Encrypt text with integrated function */
    err_code = nrf_crypto_aes_crypt(&ecb_encr_ctx,
                                   p_ecb_info,
                                   NRF_CRYPTO_ENCRYPT,
                                   owner_account_key,
                                   NULL,
                                   (uint8_t *)rsp_data_buf,
                                   BEACON_PARAMETERS_RSP_ADD_DATA_LEN,
                                   (uint8_t *)rsp_data_enc,
                                   &len_out);
    if(NRF_SUCCESS != err_code)
    {
       NRF_LOG_ERROR("nrf_crypto_aes_crypt err %x\n",err_code);
    }

//rsp response
     rsp_buf[0] = BEACON_ACTIONS_BEACON_PARAMETERS_READ;
     rsp_buf[1] = BEACON_PARAMETERS_RSP_PAYLOAD_LEN;
     auth_data.data_len = BEACON_PARAMETERS_RSP_PAYLOAD_LEN;
     auth_data.add_data = rsp_data_enc;

     auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
     auth_data_buf[auth_data_buf_len]=0x01;
     ++auth_data_buf_len;

     nrf_crypto_hmac_context_t m_context;
     uint8_t local_auth_seg[NRF_CRYPTO_HASH_SIZE_SHA256] = {0};
     size_t local_auth_seg_len = sizeof(local_auth_seg);

        // Initialize frontend (which also initializes backend).
     err_code = nrf_crypto_hmac_init(&m_context,
                                    &g_nrf_crypto_hmac_sha256_info,
                                    owner_account_key,
                                    FP_ACCOUNT_KEY_LEN);
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_init err %x\n",err_code);
      }
    

    // Push all data in one go (could be done repeatedly)
    err_code = nrf_crypto_hmac_update(&m_context, auth_data_buf, auth_data_buf_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_update err %x\n",err_code);
      }

    // Finish calculation
    err_code = nrf_crypto_hmac_finalize(&m_context, local_auth_seg, &local_auth_seg_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_finalize err %x\n",err_code);
      }

    memcpy(rsp_buf+2,local_auth_seg,FP_FMDN_AUTH_SEG_LEN);
    memcpy(rsp_buf+2+FP_FMDN_AUTH_SEG_LEN,rsp_data_enc,FP_CRYPTO_AES128_BLOCK_LEN);

}
static int provisioning_state_read_handle(uint8_t *data,uint16_t len,uint8_t *rsp_buf)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    size_t auth_data_buf_len = 0;
    bool result =false;
   // bool provisioned = false;
       ret_code_t            err_code;
    static const uint8_t req_data_len = PROVISIONING_STATE_REQ_PAYLOAD_LEN;
    uint8_t rsp_data_len;
    struct fp_fmdn_auth_data auth_data;
     //NRF_LOG_INFO("provisioning_state_read_handle ##########################\n");
    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);

    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = random_nonce;
    auth_data.data_id = BEACON_ACTIONS_PROVISIONING_STATE_READ;
    auth_data.data_len = req_data_len;

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
    //print_hex(" auth_data_buf1: ", auth_data_buf, auth_data_buf_len);
     //print_hex(" auth_segget ", auth_seg, 8);
    result = account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);
    if(result == false)
    {
      return;
    }

    //NRF_LOG_INFO("provisioning_state_read_handle result %x provisoned %x\n",result,beacon_provisioned);

    /* Prepare response payload. */
    rsp_data_len = beacon_provisioned ? PROVISIONING_STATE_RSP_PAYLOAD_LEN :
		(PROVISIONING_STATE_RSP_PAYLOAD_LEN - PROVISIONING_STATE_RSP_EID_LEN);
     NRF_LOG_INFO("rsp_data_len %x\n",rsp_data_len);
    //uint8_t rsp_buf[PROVISIONING_STATE_RSP_LEN];
    rsp_buf[0] = BEACON_ACTIONS_PROVISIONING_STATE_READ;
    rsp_buf[1] = rsp_data_len;
    if(beacon_provisioned == true)
    {
      rsp_buf[BEACON_ACTIONS_HEADER_LEN+BEACON_ACTIONS_RSP_AUTH_SEG_LEN] = 0x03;
      memcpy(rsp_buf+BEACON_ACTIONS_HEADER_LEN+BEACON_ACTIONS_RSP_AUTH_SEG_LEN+1,fmdn_eid,32);
    }
    else
    {
      rsp_buf[BEACON_ACTIONS_HEADER_LEN+BEACON_ACTIONS_RSP_AUTH_SEG_LEN] = 0x02;
    }

    auth_data.data_len = rsp_data_len;
    auth_data.add_data = rsp_buf+BEACON_ACTIONS_HEADER_LEN+BEACON_ACTIONS_RSP_AUTH_SEG_LEN;
    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
    auth_data_buf[auth_data_buf_len]=0x01;
    ++auth_data_buf_len;
     NRF_LOG_INFO("auth_data_buf_len %x\n",auth_data_buf_len);
    print_hex(" auth_data_bufrsp: ", auth_data_buf, auth_data_buf_len);
     print_hex("owner_account_key:", owner_account_key, 16);
     nrf_crypto_hmac_context_t m_context;
     uint8_t local_auth_seg[NRF_CRYPTO_HASH_SIZE_SHA256] = {0};
     size_t local_auth_seg_len = sizeof(local_auth_seg);

