guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
        // Initialize frontend (which also initializes backend).
     err_code = nrf_crypto_hmac_init(&m_context,
                                    &g_nrf_crypto_hmac_sha256_info,
                                    owner_account_key,
                                    FP_ACCOUNT_KEY_LEN);
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_init err %x\n",err_code);
      }
    

    // Push all data in one go (could be done repeatedly)
    err_code = nrf_crypto_hmac_update(&m_context, auth_data_buf, auth_data_buf_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_update err %x\n",err_code);
      }

    // Finish calculation
    err_code = nrf_crypto_hmac_finalize(&m_context, local_auth_seg, &local_auth_seg_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_finalize err %x\n",err_code);
      }
 print_hex(" local_auth_seg_rsp ", local_auth_seg, 8);
      memcpy(rsp_buf+BEACON_ACTIONS_HEADER_LEN,local_auth_seg,FP_FMDN_AUTH_SEG_LEN);
     //  print_hex(" rsp_buf ", rsp_buf, PROVISIONING_STATE_RSP_LEN);
    



}

static ret_code_t fp_crypto_aes256_ecb_encryptwithEik( uint8_t *output, uint8_t *input)
{
//    uint8_t input[] = {
//    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
//    0xff, 0xff, 0xff, 0x0a, 0x12, 0x34, 0x54, 0x00,
//    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
//    0x00, 0x00, 0x00, 0x0a, 0x12, 0x34, 0x54, 0x00,
//};

//// ????256???
//  uint8_t aes_ecb_256_key[] = {
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//};

//  uint8_t encrypted_data[32];
ret_code_t            err_code;
  mbedtls_aes_context aes_ctx;
     NRF_LOG_INFO("aes ecb 256 encrypt start:\n");

    mbedtls_aes_init(&aes_ctx);
    
 
    err_code = mbedtls_aes_setkey_enc(&aes_ctx, new_eik, 256);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to set encryption key, error: %d", err_code);
        goto cleanup1;
    }

    mbedtls_aes_crypt_ecb(&aes_ctx, MBEDTLS_AES_ENCRYPT, input, output);
    if (err_code != 0) {
           NRF_LOG_INFO("Decryption failed at block %d, error: %d", 16, err_code);
            goto cleanup1;
        }
    mbedtls_aes_crypt_ecb(&aes_ctx, MBEDTLS_AES_ENCRYPT, input + 16, output + 16);
   if (err_code != 0) {
           NRF_LOG_INFO("Decryption failed at block %d, error: %d", 16, err_code);
            goto cleanup1;
        }

    NRF_LOG_INFO("Encrypted data (hex):\n");

    NRF_LOG_HEXDUMP_INFO(output,32);
    NRF_LOG_INFO("\n");
cleanup1:
    mbedtls_aes_free(&aes_ctx);
    return err_code;
  



}


static ret_code_t calculate_secp256r1_point(uint8_t *out,uint8_t *mod,uint8_t *in)
{
 ret_code_t err_code;
   
    // 1. Initialize mbedtls contexts
    mbedtls_ecp_group grp;
    mbedtls_mpi in_mpi, in_prime_mpi, n_mpi, out1_mpi, out2_mpi;
    mbedtls_ecp_point P;
mbedtls_ecp_group_init(&grp);
    mbedtls_mpi_init(&in_mpi);
    mbedtls_mpi_init(&in_prime_mpi);
    mbedtls_mpi_init(&n_mpi);
    mbedtls_ecp_point_init(&P);
    mbedtls_mpi_init(&out1_mpi);
    mbedtls_mpi_init(&out2_mpi);

// 2. Set up the elliptic curve group (secp256r1)
    err_code = mbedtls_ecp_group_load(&grp, MBEDTLS_ECP_DP_SECP256R1);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to load secp256r1 group: %d\n", err_code);
        goto cleanup;
    }
// 3. Convert the input scalar 'in' to an mbedtls bignum
    //unsigned char in[] = {
    //    0x52, 0xc7, 0x46, 0xbf, 0x4a, 0xb7, 0xc7, 0xc3,
    //    0x5f, 0x0d, 0xdb, 0x3b, 0x2c, 0x86, 0x32, 0xd1,
    //    0x29, 0xf0, 0xa0, 0x45, 0x3f, 0x76, 0x76, 0x7a,
    //    0x29, 0xf0, 0x33, 0xd0, 0x0d, 0xee, 0x96, 0xba,
    //};
    err_code = mbedtls_mpi_read_binary(&in_mpi, in, 32);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to read input scalar: %d\n", err_code);
        goto cleanup;
    }
// 4. Calculate in' = in mod n
    err_code = mbedtls_mpi_copy(&n_mpi, &grp.N); // Copy the order of the curve (n)
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to copy group order: %d\n", err_code);
        goto cleanup;
    }
    err_code = mbedtls_mpi_mod_mpi(&in_prime_mpi, &in_mpi, &n_mpi);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to calculate in mod n: %d\n", err_code);
        goto cleanup;
    }
    // Convert in_prime_mpi to a byte array for comparison
 //   unsigned char in_prime_calculated[32];
    err_code = mbedtls_mpi_write_binary(&in_prime_mpi, mod, 32);
     if (err_code != 0) {
        NRF_LOG_INFO("Failed to write in_prime to binary: %d\n", err_code);
        goto cleanup;
    }

    // 5. Perform scalar multiplication: in' * (Gx, Gy)
    err_code = mbedtls_ecp_mul(&grp, &P, &in_prime_mpi, &grp.G, NULL, NULL);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to perform scalar multiplication: %d\n", err_code);
        goto cleanup;
    }
// 6. Extract the x-coordinate (out1)
     err_code = mbedtls_mpi_copy(&out1_mpi, &P.X);
        if (err_code != 0) {
        NRF_LOG_INFO("Failed to copy out1: %d\n", err_code);
        goto cleanup;
    }
//      unsigned char out1_calculated[32];
    err_code = mbedtls_mpi_write_binary(&out1_mpi, out, 32);
     if (err_code != 0) {
        NRF_LOG_INFO("Failed to write out1 to binary: %d\n", err_code);
        goto cleanup;
    }

    // Print the calculated values for comparison
    NRF_LOG_INFO("111Calculated in':\n");
    //for (int i = 0; i < 32; i++) {
    //    NRF_LOG_INFO("0x%02x, ", in_prime_calculated[i]);
    //}
    NRF_LOG_HEXDUMP_INFO(mod,32);
    NRF_LOG_INFO("\n");
    NRF_LOG_INFO("111Calculated out1:\n");
    //for (int i = 0; i < 32; i++) {
    //    printf("0x%02x, ", out1_calculated[i]);
    //}
    NRF_LOG_HEXDUMP_INFO(out,32);
    NRF_LOG_INFO("\n");



    
NRF_LOG_INFO("success&&&&&&&&&&&&&&&&&&&&&&&&&\n");
cleanup:
    mbedtls_ecp_group_free(&grp);
    mbedtls_mpi_free(&in_mpi);
    mbedtls_mpi_free(&in_prime_mpi);
    mbedtls_mpi_free(&n_mpi);
    mbedtls_ecp_point_free(&P);
    mbedtls_mpi_free(&out1_mpi);
    mbedtls_mpi_free(&out2_mpi);
    return err_code;

