guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
}

extern void fmdn_adv_set_setup();
static int ephemeral_identity_key_set_handle(uint8_t *data,uint16_t len,uint8_t *rsp_buf)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    uint8_t secp_mod_res[FP_FMDN_STATE_EID_LEN];
    size_t auth_data_buf_len = 0;
    bool result =false;
//    uint8_t new_eik[EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN];
    uint8_t *encrypted_eik;
    const uint8_t req_data_len = beacon_provisioned ?
		EPHEMERAL_IDENTITY_KEY_SET_REQ_PROVISIONED_PAYLOAD_LEN :
		EPHEMERAL_IDENTITY_KEY_SET_REQ_UNPROVISIONED_PAYLOAD_LEN;
//    static const uint8_t rsp_data_len = EPHEMERAL_IDENTITY_KEY_SET_RSP_PAYLOAD_LEN;
    struct fp_fmdn_auth_data auth_data;
    ret_code_t            err_code;

    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);
    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = random_nonce;
    auth_data.data_id = BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET;
    auth_data.data_len = req_data_len;
    auth_data.add_data = (data + 2 + FP_FMDN_AUTH_SEG_LEN);

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
    print_hex(" auth_data_buf1: ", auth_data_buf, auth_data_buf_len);
    print_hex(" auth_segget ", auth_seg, 8);
    result = account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);

    NRF_LOG_INFO("ephemeral_identity_key_set_handle result %x\n",result);

    nrf_crypto_aes_info_t const * p_ecb_info_eik;
    nrf_crypto_aes_context_t      ecb_decr_ctx_eik;
    p_ecb_info_eik = &g_nrf_crypto_aes_ecb_128_info;
    size_t      len_out_eik;
//    uint8_t raw_req_accountkey[FP_CRYPTO_AES128_BLOCK_LEN];
    err_code = nrf_crypto_aes_init(&ecb_decr_ctx_eik,
                                  p_ecb_info_eik,
                                  NRF_CRYPTO_DECRYPT);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_aes_init err %x\n",err_code);
    }

    /* Set encryption and decryption key */

    err_code = nrf_crypto_aes_key_set(&ecb_decr_ctx_eik, owner_account_key);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_aes_key_set err %x\n",err_code);
    }

    /* Decrypt blocks */
    len_out_eik = EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN;
    err_code = nrf_crypto_aes_finalize(&ecb_decr_ctx_eik,
                                      (uint8_t *)auth_data.add_data,
                                      EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN,
                                      (uint8_t *)new_eik,
                                      &len_out_eik);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_aes_finalize err %x\n",err_code);
    }

    uint32_t  fmdn_clock_copy;
    fmdn_clock_copy = fmdn_clock;
    /* Clear the K lowest bits in the clock value. */
    fmdn_clock_copy &= ~BIT_MASK(FMDN_EID_SEED_ROT_PERIOD_EXP);
    uint8_t eid_seed_buf[FMDN_EID_SEED_LEN];
    memset(eid_seed_buf,FMDN_EID_SEED_PADDING_TYPE_ONE,FMDN_EID_SEED_PADDING_LEN);
    eid_seed_buf[FMDN_EID_SEED_PADDING_LEN] = FMDN_EID_SEED_ROT_PERIOD_EXP;
    uint8_t clock_bigendian[FMDN_EID_SEED_FMDN_CLOCK_LEN];
    sys_put_be32(fmdn_clock_copy,clock_bigendian);
    memcpy(eid_seed_buf+FMDN_EID_SEED_PADDING_LEN+FMDN_EID_SEED_ROT_PERIOD_EXP_LEN,clock_bigendian,FMDN_EID_SEED_FMDN_CLOCK_LEN);
    //2 half
    memset(eid_seed_buf+(FMDN_EID_SEED_LEN/2),FMDN_EID_SEED_PADDING_TYPE_TWO,FMDN_EID_SEED_PADDING_LEN);
    eid_seed_buf[(FMDN_EID_SEED_LEN/2)+FMDN_EID_SEED_PADDING_LEN] = FMDN_EID_SEED_ROT_PERIOD_EXP;

    memcpy(eid_seed_buf+(FMDN_EID_SEED_LEN/2)+FMDN_EID_SEED_PADDING_LEN+FMDN_EID_SEED_ROT_PERIOD_EXP_LEN,clock_bigendian,FMDN_EID_SEED_FMDN_CLOCK_LEN);

    print_hex(" eid_seed_buf: ", eid_seed_buf, FMDN_EID_SEED_LEN);
    
    uint8_t encrypted_eid_seed[FP_CRYPTO_AES256_BLOCK_LEN];
     err_code = fp_crypto_aes256_ecb_encryptwithEik(encrypted_eid_seed,eid_seed_buf);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("fp_crypto_aes256_ecb_encryptwithEik err %x\n",err_code);
    }
    //uint8_t fmdn_eid[32];
     err_code = calculate_secp256r1_point(fmdn_eid,secp_mod_res,encrypted_eid_seed);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("calculate_secp256r1_point err %x\n",err_code);
    }
     print_hex(" eid_seed_buf: ", eid_seed_buf, FMDN_EID_SEED_LEN);

     nrf_crypto_hash_context_t   hash_context;
     //uint8_t  Anti_Spoofing_AES_Key[NRF_CRYPTO_HASH_SIZE_SHA256];
     size_t digest_len = NRF_CRYPTO_HASH_SIZE_SHA256;
     uint8_t mod_res_hash[FP_CRYPTO_SHA256_HASH_LEN];

           // Initialize the hash context
     err_code = nrf_crypto_hash_init(&hash_context, &g_nrf_crypto_hash_sha256_info);
     if(NRF_SUCCESS != err_code)
     {
        NRF_LOG_ERROR("nrf_crypto_hash_init err %x\n",err_code);
     }

    // Run the update function (this can be run multiples of time if the data is accessible
    // in smaller chunks, e.g. when received on-air.
     err_code = nrf_crypto_hash_update(&hash_context, secp_mod_res, FP_FMDN_STATE_EID_LEN);
     if(NRF_SUCCESS != err_code)
     {
        NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
     }

    // Run the finalize when all data has been fed to the update function.
    // this gives you the result
     err_code = nrf_crypto_hash_finalize(&hash_context, mod_res_hash, &digest_len);
     if(NRF_SUCCESS != err_code)
     {
       NRF_LOG_ERROR("nrf_crypto_hash_finalize err %x\n",err_code);
     }
     uint8_t fmdn_frame_hashed_flags_xor_operand;

     fmdn_frame_hashed_flags_xor_operand = mod_res_hash[sizeof(mod_res_hash) - 1];

//hashed flags encode
     uint8_t hashed_flags_seed;
     uint8_t hashed_flags_byte;
     hashed_flags_seed = 0;
     hashed_flags_byte = (hashed_flags_seed ^ fmdn_frame_hashed_flags_xor_operand);

     fmdn_service_data[0]= 0x40;
     memcpy(fmdn_service_data+1,fmdn_eid,32);

     fmdn_adv_set_setup();
     beacon_provisioned = true;

     //uint8_t rsp_buf[1+1+8];
     rsp_buf[0] = BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET;
     rsp_buf[1] = EPHEMERAL_IDENTITY_KEY_SET_RSP_PAYLOAD_LEN;
     auth_data.data_len = EPHEMERAL_IDENTITY_KEY_SET_RSP_PAYLOAD_LEN;
     auth_data.add_data = NULL;

     auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
     auth_data_buf[auth_data_buf_len]=0x01;
     ++auth_data_buf_len;

     nrf_crypto_hmac_context_t m_context;
     uint8_t local_auth_seg[NRF_CRYPTO_HASH_SIZE_SHA256] = {0};
     size_t local_auth_seg_len = sizeof(local_auth_seg);

